from jinja2 import Template

# Различные способы экранирования данных в строках


def func_0():
    data = '''Модуль Jinja вместо определения {{ name }} подставляет соответствующее значение'''

    tm = Template(data)
    msg = tm.render(name='Fedor')
    print(msg)

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# Jinja #2. Экранирование. Блоки raw, for и if.
#  {% raw %} ... {% endraw %}

# ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////


def func_1():
    data = '''{% raw %}Модуль Jinja вместо определения {{ name }} подставляет соответствующее значение{% endraw %}'''

    tm = Template(data)
    msg = tm.render(name='Fedor')
    print(msg)


def func_2():

    link = '''В HTML-документе ссылки определяются так: <a href="#">Ссылка</a>'''

    tm = Template(link)
    msg = tm.render()
    print(msg)


if __name__ == '__main__':
    func_0()
    func_1()
